{
    "intents": [
        {
            "tag": "Tsunami",
            "patterns": [
                "How to save myself during a tsunami?",
                "What should I do during a tsunami?",
                "How to stay safe during a tsunami?",
                "Tsunami safety tips",
                "Steps to follow during a tsunami warning",
                "How can I protect myself if a tsunami hits?",
                "What to avoid during a tsunami?",
                "How to ensure safety in a tsunami?",
                "Tips for tsunami safety",
                "How to act during a tsunami alert?"
            ],
            "responses": [
                "If you are near the coast and a tsunami warning is issued, move to higher ground immediately and stay there. Avoid going to the beach to watch the waves. If you are in a car, drive inland away from the coast. Stay tuned to official information sources and follow evacuation orders.",
                "During a tsunami, the best thing to do is to seek higher ground as quickly as possible. Tsunamis can be deadly, so it's crucial to stay away from the shore and avoid driving through flooded areas.",
                "In case of a tsunami, move to an elevated area and stay away from the coast. Do not return to the shore until authorities declare it safe. Listen to emergency alerts and follow instructions from local officials."
            ]
        },
        {
            "tag": "Earthquake",
            "patterns": [
                "What to do during an earthquake?",
                "How to protect yourself during an earthquake?",
                "Earthquake safety tips",
                "How to stay safe during an earthquake?",
                "Steps to follow when an earthquake strikes",
                "How to ensure safety during an earthquake?",
                "What actions should I take in an earthquake?",
                "Safety measures for earthquakes",
                "What to do if there’s an earthquake?",
                "How to stay safe from earthquake tremors?"
            ],
            "responses": [
                "Drop, cover, and hold on during shaking. If you are indoors, take cover under a sturdy piece of furniture and protect your head and neck. If you are outdoors, move away from buildings, streetlights, and utility wires. If you are in a car, pull over to a safe area and remain inside the vehicle until the shaking stops.",
                "During an earthquake, drop to your hands and knees, cover your head and neck, and stay in place until the shaking stops. Avoid standing near windows or other objects that could fall and cause injury.",
                "If you experience an earthquake, find a safe spot away from windows and heavy furniture. Protect your head and stay there until the shaking ceases. If you are outside, move to an open area away from buildings and power lines."
            ]
        },
        {
            "tag": "Flood",
            "patterns": [
                "How to stay safe during a flood?",
                "What to do if there is a flood?",
                "Flood safety tips",
                "How to protect yourself from flooding?",
                "Steps to take in case of a flood",
                "How to act during a flood emergency?",
                "Flood preparedness tips",
                "Safety measures for floods",
                "How to remain safe during floodwaters?",
                "What should I do during a flood event?"
            ],
            "responses": [
                "Move to higher ground and stay away from floodwaters. Avoid walking or driving through flooded areas. If you are advised to evacuate, do so immediately. Stay informed through local news and follow instructions from authorities.",
                "If you are in a flood situation, move to a higher elevation and avoid walking through moving water. Floods can be very dangerous, so follow evacuation orders and stay informed about the latest updates.",
                "During a flood, stay indoors and avoid traveling unless absolutely necessary. If water is rising, move to the highest possible level in your building and await further instructions from emergency services."
            ]
        },
        {
            "tag": "Fire",
            "patterns": [
                "What should I do during a fire?",
                "How to stay safe during a fire?",
                "Fire safety tips",
                "How to protect myself in a fire?",
                "Steps to follow during a fire emergency",
                "How to act if there's a fire?",
                "Fire preparedness and safety",
                "What actions to take in a fire?",
                "How to escape during a fire?",
                "Safety measures for fire incidents"
            ],
            "responses": [
                "If you are caught in a fire, try to stay low to avoid smoke inhalation. Use a cloth to cover your nose and mouth. If there is a safe exit, evacuate the building quickly. Do not use elevators. If you are trapped, signal for help and stay by a window where rescuers can see you.",
                "During a fire, stay low to the ground to avoid smoke inhalation, use a wet cloth to cover your face, and exit the building as quickly as possible. Avoid using elevators and look for safe exit routes.",
                "In the event of a fire, quickly find your nearest exit and evacuate. If smoke is present, stay low and cover your nose and mouth with a cloth. Do not use elevators; they may become inoperative during a fire."
            ]
        },
        {
            "tag": "Hurricane",
            "patterns": [
                "How to prepare for a hurricane?",
                "What to do during a hurricane?",
                "Hurricane safety tips",
                "How to stay safe during a hurricane?",
                "Steps to take before and during a hurricane",
                "Hurricane preparedness advice",
                "How to protect yourself from a hurricane?",
                "What actions should I take for a hurricane?",
                "Safety measures during a hurricane",
                "How to stay safe in hurricane conditions?"
            ],
            "responses": [
                "Prepare an emergency kit with essentials like water, food, medications, and important documents. Secure your home by boarding up windows and reinforcing doors. Follow evacuation orders and move to a designated shelter if instructed. Stay indoors and away from windows during the storm.",
                "Before a hurricane, make sure you have an emergency kit ready and your home is secured. During the hurricane, stay indoors, away from windows, and listen to local news for updates. Follow evacuation orders if instructed.",
                "To stay safe during a hurricane, ensure your home is fortified, stock up on emergency supplies, and stay indoors. Avoid going outside during the storm, and stay informed through weather updates and emergency notifications."
            ]
        }
    ]
}
